### CHAPTER 7
# Data Cleaning and Preparation

In [1]:
import pandas as pd
import numpy as np

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isnull()

0    False
1    False
2     True
dtype: bool

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data.dropna()  # Drops any row with NaN values

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')  # Drops any row with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis="columns", how='all')  # Drops any column with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  0.012686  0.193336  0.576212
1  0.470112 -0.091488 -0.867041
2  2.256118 -0.608665  0.657331
3 -0.303343  1.159634  1.522421
4 -1.196241 -0.578874  0.609504
5  1.188805  1.784530  0.292386
6  0.454409  0.236474  1.102156

In [16]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.012686       NaN       NaN
1  0.470112       NaN       NaN
2  2.256118       NaN  0.657331
3 -0.303343       NaN  1.522421
4 -1.196241 -0.578874  0.609504
5  1.188805  1.784530  0.292386
6  0.454409  0.236474  1.102156

In [17]:
df.dropna()

          0         1         2
4 -1.196241 -0.578874  0.609504
5  1.188805  1.784530  0.292386
6  0.454409  0.236474  1.102156

In [18]:
df.dropna(thresh=2)  # Keep only rows with at least 2 non-NaN values

          0         1         2
2  2.256118       NaN  0.657331
3 -0.303343       NaN  1.522421
4 -1.196241 -0.578874  0.609504
5  1.188805  1.784530  0.292386
6  0.454409  0.236474  1.102156

### Filling In Missing Data

In [19]:
df.fillna(0)  # Fill NaN values with 0

          0         1         2
0  0.012686  0.000000  0.000000
1  0.470112  0.000000  0.000000
2  2.256118  0.000000  0.657331
3 -0.303343  0.000000  1.522421
4 -1.196241 -0.578874  0.609504
5  1.188805  1.784530  0.292386
6  0.454409  0.236474  1.102156

In [20]:
df.fillna({1:0.5, 2:0})  # Fill NaN values in column 1 with 0.5 and column 2 with 0

          0         1         2
0  0.012686  0.500000  0.000000
1  0.470112  0.500000  0.000000
2  2.256118  0.500000  0.657331
3 -0.303343  0.500000  1.522421
4 -1.196241 -0.578874  0.609504
5  1.188805  1.784530  0.292386
6  0.454409  0.236474  1.102156

In [21]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  2.339754  0.022446  2.108832
1 -1.479821 -0.155514  0.965886
2 -0.141113       NaN  0.660051
3  0.140077       NaN  0.478084
4 -0.544611       NaN       NaN
5  0.503543       NaN       NaN

In [22]:
df.fillna(method='ffill')  # Forward fill NaN values

C:\Users\sahor\AppData\Local\Temp\ipykernel_9908\2883871002.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')  # Forward fill NaN values

          0         1         2
0  2.339754  0.022446  2.108832
1 -1.479821 -0.155514  0.965886
2 -0.141113 -0.155514  0.660051
3  0.140077 -0.155514  0.478084
4 -0.544611 -0.155514  0.478084
5  0.503543 -0.155514  0.478084

In [23]:
df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

C:\Users\sahor\AppData\Local\Temp\ipykernel_9908\3537515366.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

          0         1         2
0  2.339754  0.022446  2.108832
1 -1.479821 -0.155514  0.965886
2 -0.141113 -0.155514  0.660051
3  0.140077 -0.155514  0.478084
4 -0.544611       NaN  0.478084
5  0.503543       NaN  0.478084

In [24]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [25]:
data.fillna(data.mean())  # Fill NaN values with the mean of the Series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [26]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated()  # Check for duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates()  # Drop duplicate rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [29]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [31]:
data.drop_duplicates(subset=["k1"])  # Drop duplicates based on column 'k1'

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(["k1", "k2"], keep="last")  # Drop duplicates based on columns 'k1' and 'k2'

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [33]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [35]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [36]:
data =pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace(-999, np.nan)  # Replace -999 with NaN

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [38]:
data.replace([-999, -1000], np.nan)  # Replace -999 and -1000 with NaN

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [39]:
data.replace([-999, -1000], [np.nan, 0])  # Replace -999 with NaN and -1000 with 0

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [40]:
data.replace({-999:np.nan, -1000:0})  # Replace -999 with NaN and -1000 with 0 using a dictionary

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [41]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

### Renaming Axis Indexes

In [42]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), 
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [43]:
def transform(x):
    return x[:4].upper()
data.index = data.index.map(transform)

In [44]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [45]:
data.rename(index=str.title, columns=str.upper)  # Rename index and columns with functions

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [46]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [47]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})  # Rename specific index and column labels

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [48]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### Discretization and Binning

In [49]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [50]:
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [52]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [53]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [54]:
pd.value_counts(age_categories)

C:\Users\sahor\AppData\Local\Temp\ipykernel_9908\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [55]:
pd.cut(ages, bins, right=False)  # Left-inclusive bins

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [56]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)  # Use custom labels for the bins

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [57]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)  # Cut into 4 equal-width bins with 2 decimal places

[(0.52, 0.75], (0.75, 0.97], (0.75, 0.97], (0.52, 0.75], (0.3, 0.52], ..., (0.3, 0.52], (0.75, 0.97], (0.75, 0.97], (0.3, 0.52], (0.075, 0.3]]
Length: 20
Categories (4, interval[float64, right]): [(0.075, 0.3] < (0.3, 0.52] < (0.52, 0.75] < (0.75, 0.97]]

In [58]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)  # Cut into 4 equal-size bins with 2 decimal places
quartiles

[(0.66, 3.0], (0.66, 3.0], (0.02, 0.66], (0.02, 0.66], (0.66, 3.0], ..., (0.02, 0.66], (-0.62, 0.02], (0.02, 0.66], (-3.17, -0.62], (-3.17, -0.62]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.17, -0.62] < (-0.62, 0.02] < (0.02, 0.66] < (0.66, 3.0]]

In [59]:
pd.value_counts(quartiles)

C:\Users\sahor\AppData\Local\Temp\ipykernel_9908\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.17, -0.62]    250
(-0.62, 0.02]     250
(0.02, 0.66]      250
(0.66, 3.0]       250
Name: count, dtype: int64

In [60]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.0]).value_counts()

(-3.1559999999999997, -1.305]    100
(-1.305, 0.02]                   400
(0.02, 1.251]                    400
(1.251, 3.003]                   100
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [61]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004744    -0.007909    -0.017197    -0.025654
std       1.037885     0.988933     1.015900     1.019727
min      -3.617535    -2.998525    -3.320087    -3.866558
25%      -0.657908    -0.670414    -0.697215    -0.706839
50%      -0.011382    -0.076070    -0.038618    -0.030697
75%       0.744852     0.671054     0.658578     0.688234
max       3.729387     3.288297     3.239103     3.150630

In [62]:
col = data[2]
col[col.abs() > 3]

160    3.239103
722   -3.120697
901   -3.320087
981   -3.018693
Name: 2, dtype: float64

In [63]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
52  -3.508179 -0.972409 -1.452420  0.053645
93   0.856756  0.671583 -1.791966 -3.866558
160  1.754271  0.541400  3.239103 -2.318999
222 -2.070725  3.185705  0.965597  0.530763
293  3.729387 -0.223085 -1.372045 -1.834637
341 -3.617535 -0.240233  1.122051  0.852986
429  1.444064  3.288297 -0.301312  2.389909
465 -3.335769  0.512319 -1.847940 -1.470052
722  1.478992  0.209973 -3.120697 -1.182014
744  0.602205  0.457167  0.521726  3.150630
901  0.918816 -1.213327 -3.320087 -0.792817
981  1.541884 -0.216031 -3.018693 -0.813076

In [64]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005477    -0.008383    -0.016977    -0.024938
std       1.030900     0.987429     1.013750     1.016364
min      -3.000000    -2.998525    -3.000000    -3.000000
25%      -0.657908    -0.670414    -0.697215    -0.706839
50%      -0.011382    -0.076070    -0.038618    -0.030697
75%       0.744852     0.671054     0.658578     0.688234
max       3.000000     3.000000     3.000000     3.000000

In [65]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1 -1.0  1.0 -1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0  1.0  1.0 -1.0
4  1.0 -1.0 -1.0  1.0

### Permutation and Random Sampling

In [66]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [67]:
sampler = np.random.permutation(5)
sampler

array([1, 0, 3, 2, 4], dtype=int32)

In [68]:
len(df)

5

In [69]:
df.take(sampler)  # Randomly permute the rows of the DataFrame

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

In [70]:
df.iloc[sampler]  # Randomly permute the rows of the DataFrame

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34

In [71]:
df.sample(n=3)  # Randomly sample 3 rows from the DataFrame

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13

In [72]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [73]:
choices.sample(n=10, replace=True)  # Sample with replacement

4    4
4    4
2   -1
2   -1
4    4
1    7
0    5
2   -1
2   -1
4    4
dtype: int64

In [74]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [75]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [76]:
pd.get_dummies(df["key"]).astype(int)  # One-hot encoding

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [77]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=int)  # Prefix for the column names
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [78]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [79]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python",
                       encoding="latin-1")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [80]:
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [81]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [82]:
np.random.seed(12345)
values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [83]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins), dtype=int)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 Extension Data Types

In [84]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [85]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [86]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [87]:
s.dtype

Int64Dtype()

In [88]:
s[3] is pd.NA

True

In [89]:
s = pd.Series([1, 2, 3, None], dtype="Int64")
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [90]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [91]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "c": [False, None, False, True]})
df

     A      B      c
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [92]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["c"] = df["c"].astype("boolean")
df

      A      B      c
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

## 7.4 String Manipulation

### Python Built-In String Object Methods

In [93]:
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [94]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [95]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [96]:
"::".join(pieces)

'a::b::guido'

In [97]:
"guido" in val

True

In [98]:
val.index(",")

1

In [99]:
val.find(":")

-1

In [100]:
val.count(",")

2

In [101]:
val.replace(",", "::")

'a::b::  guido'

In [102]:
val.replace(",", "")

'ab  guido'

In [103]:
val.split()

['a,b,', 'guido']

### Regular Expressions

In [104]:
import re
text = "foo   bar\t baz  \tqux"
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [105]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [106]:
regex.findall(text)

['   ', '\t ', '  \t']

In [113]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"
regex = re.compile(pattern, flags=re.IGNORECASE)  # re.IGNORECASE makes the regex case-insensitivez
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [114]:
m = regex.search(text)
m

In [115]:
text[m.start():m.end()]

'dave@google.com'

In [116]:
print(regex.match(text))

None

In [117]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [119]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match("wesm@bright.nrt")
m.groups()

('wesm', 'bright', 'nrt')

In [120]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [121]:
print(regex.sub(r"Username:\1, Domain:\2, Suffix:\3", text))

Dave Username:dave, Domain:google, Suffix:com
Steve Username:steve, Domain:gmail, Suffix:com
Rob Username:rob, Domain:gmail, Suffix:com
Ryan Username:ryan, Domain:yahoo, Suffix:com

### String Functions in pandas

In [122]:
data = {"Dave": "dave@google.com",
        "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com",
        "Wes": np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [123]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [124]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [125]:
data_as_string_ext = data.astype('string')
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [126]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [127]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [133]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [134]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [135]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [136]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

## 7.5 Categorical Data

### Background and Motivation

In [137]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [138]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [139]:
pd.value_counts(values)

C:\Users\sahor\AppData\Local\Temp\ipykernel_9908\3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [140]:
values.value_counts()

apple     6
orange    2
Name: count, dtype: int64